In [59]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
import math
import warnings
warnings.filterwarnings("ignore")

In [60]:
df = pd.read_csv("homeprices2.csv")
df.drop(labels=[5], inplace=True)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [61]:
median_beadrooms = math.floor(df.bedrooms.median())
median_beadrooms

3

In [62]:
df.bedrooms= df.bedrooms.fillna(median_beadrooms) #replace NaN value with median

In [63]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       3.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [64]:
reg = LinearRegression()

In [65]:
reg.fit(df[["area", "bedrooms","age"]], df.price)

LinearRegression()

In [66]:
reg.coef_

array([   137.25, -26025.  ,  -6825.  ])

In [67]:
reg.intercept_

383724.9999999998

In [70]:
reg.predict([[3000,4,40]])

array([418375.])